{"data":[{"desc":"  games intro:    The Princess of Polynesia wants a new hairstyle, so let's move our hands now to design a unique hairstyle for the princess, so that she can shine. Dress up as a princess!    games playing:    mouse action     games target:    A haircut for a Polynesian princess.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/black-princess-haircut/","tags":"","cat":37,"title":"Black Princess Haircut","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14052.jpg","played":"","date":""},{"desc":"  games intro:    Elsa has not had a day of leisure since she gave birth to twins. This is another day for the ordinary Elsa family, let's help them clean up the room, and coax the children so that they can have a good time!    games playing:    mouse action     games target:    Clean up the room, feed the child and take care of the child.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/elsas-day/","img":"/cover/9821_818394.jpg","title":"Elsa's Day","date":"","tags":"","cat":37,"played":""},{"desc":"  games intro:    This is a princesses of the album, players can be painted on it at will, giving black and white princess album with new colors it! Graffiti together, finish your work!    games playing:    mouse action     games target:    If the graffiti is beautiful, don't forget to share the picture in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/a-colorful-album-of-princesses/","tags":"","cat":37,"title":"A Colorful Album Of Princesses","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14026.jpg","played":"","date":""},{"desc":"  games intro:    It's Princess Anna's birthday. Let's help her dress up, have a beautiful birthday, and decorate the party. Let's get going.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/princess-celebrates-her-birthday/","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14049.jpg","title":"Princess Celebrates Her Birthday","date":"","tags":"","cat":37,"played":""},{"desc":"  games intro:    The princesses' birthdays were just around the corner, and all they had to do was put on their beautiful new clothes. Let's dress up for the princesses!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/the-princesses-birthday-party/","tags":"","cat":37,"title":"The Princesses' Birthday Party","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14030.jpg","played":"","date":""},{"desc":"This fine game called Dotted Girl Cinema Flirting is actually exciting game which is available on AiFreeGame.com absolutely for free. Dotted Girl Cinema Flirting has a vast list of categories, for example one-player and girls and many more such as cartoon, kissing, love, dress-up games as well. This is an HTML5 game and your current device supports it. All you need is your finger on mobile and mouse and keyboard on PC to be the best at this game. Have a good time playing Dotted Girl Cinema Flirting online game for free on GekoGames.","gametype":"","url":"http://h5-cdn.aifreegame.com/dotted-girl-cinema-flirting/","tags":"","cat":37,"title":"Dotted Girl Cinema Flirting","img":"/cover/8215_331141.jpg","played":"","date":""},{"desc":"The Goldie Princesses are going to the doctors today They are both pregnant so they are making one last trip to the hospital to make sure everything is going well with the babies Have fun in this new caring game and learn how to use all the medical tools then make a delicious smoothie for the two future mommies Play music and pick a belly tattoo for each princess for extra cuteness","gametype":"","url":"https://h5-cdn.aifreegame.com/goldie-princesses-pregnant-check-up/","tags":"","cat":37,"title":"Goldie Princesses Pregnant Check up","img":"/cover/8491_639900.jpg","played":"","date":""},{"desc":"Disney Princess Elsa is getting bore and dull at Frozen. So, She has a plan to go for holiday. Of course, she choose Hawaii .She is amazingly spend long hours on beach si...","gametype":"","url":"https://h5-cdn.aifreegame.com/elsa-beach-outing-preparation/","tags":"","cat":37,"title":"Elsa Beach Outing Preparation","img":"/cover/8527.png","played":"","date":""},{"desc":"  games intro:    Winter has come quietly, princesses in the campus life is about to start, campus winter dress is how son? Let's follow the princesses to dress up for the winter campus!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/princesss-winter-campus-dress/","tags":"","cat":37,"title":"Princess's Winter Campus Dress","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14040.jpg","played":"","date":""},{"desc":"This free game called Snow White Pregnancy is honestly exciting game which is available here absolutely for free. Snow White Pregnancy has a vast list of categories, for example one-player and princess and many more such as girls, baby, dress-up games as well. This is an HTML5 game so it is compatible with mobile phones and tablets. Use your finger on mobile and mouse and keyboard on PC to navigate through the game. Be our guest playing Snow White Pregnancy online game for free here.","gametype":"","url":"http://h5-cdn.aifreegame.com/snow-white-pregnancy/","tags":"","cat":37,"title":"Snow White Pregnancy","img":"/cover/8263.png","played":"","date":""},{"desc":"This browser game named Elsa Mermaid Vs Princess is definitely pleasant game which is available on Geko absolutely for free. Elsa Mermaid Vs Princess is both the frozen and dress-up and also one-player game. This is an HTML5 game and your current device supports it. To operate, just use your finger on mobile and mouse and keyboard on PC to be the best at this game. Take pleasure playing Elsa Mermaid Vs Princess online game for free on AiFreeGame.com.","gametype":"","url":"https://h5-cdn.aifreegame.com/elsa-mermaid-vs-princess/","tags":"","cat":37,"title":"Elsa Mermaid Vs Princess","img":"/cover/8189.png","played":"","date":""},{"desc":"  games intro:    Mermaid princess appearance must be stunning, first of all makeup is essential, let us first help the mermaid princess to make up a good look, so that she can surprise the appearance of!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/mermaid-princess-makeup-show/","tags":"","cat":37,"title":"Mermaid Princess Makeup Show","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14032.jpg","played":"","date":""},{"desc":"This fine game titled Luxury Bath Design is quite worthy game which is available on our site absolutely for free. Luxury Bath Design has a vast list of categories, for example one-player and girls and many more such as cleaning, other games as well. This is an HTML5 game and it is fully supported by mobile phones. Use your finger on mobile and mouse and keyboard on PC and win medals in this game. Have a good time playing Luxury Bath Design online game for free on Geko.","gametype":"","url":"https://h5-cdn.aifreegame.com/luxury-bath-design/","tags":"","cat":37,"title":"Luxury Bath Design","img":"/cover/8206.png","played":"","date":""},{"desc":"  games intro:    Princess Gaudi's wedding is just around the corner. Now let's make a dress for her and her bridesmaids. Let's do it together.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/princess-cotys-wedding/","tags":"","cat":37,"title":"Princess Coty's Wedding","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14027.jpg","played":"","date":""},{"desc":"This browser game titled Queen Of Glitter Prom Ball is quite fun game which is available here absolutely for free. Queen Of Glitter Prom Ball has a vast list of categories, for example one-player and princess and many more such as frozen, girls, dress-up, ball games as well. This is an HTML5 game so it is fully supported by your device. To controll use your finger on mobile and mouse and keyboard on PC to beat the score. Be our guest playing Queen Of Glitter Prom Ball online game for free now.","gametype":"","url":"https://h5-cdn.aifreegame.com/queen-of-glitter-prom-ball/","tags":"","cat":37,"title":"Queen Of Glitter Prom Ball","img":"/cover/8181.png","played":"","date":""},{"desc":"This online game which name is Princesses Shopping Rivals is definitely pleasant game which is available on Geko absolutely for free. Princesses Shopping Rivals has a vast list of categories, for example one-player and girls and many more such as princess, shopping, dress-up, fashion games as well. This is an HTML5 game and your current device supports it. You only need your finger on mobile and mouse and keyboard on PC to beat the score. Feel yourself at home playing Princesses Shopping Rivals online game for free on GekoGames.","gametype":"","url":"https://h5-cdn.aifreegame.com/princesses-shopping-rivals/","tags":"","cat":37,"title":"Princesses Shopping Rivals","img":"/cover/8084.png","played":"","date":""},{"desc":"  games intro:    Princess An Na and Princess Ariel began to prepare a princess's ball, now how to dress themselves up and make themselves outstanding has become their problem. Now let's dress up the most beautiful princess prom dress for them!    games playing:    mouse action     games target:    When the game is loaded, click the play button to start the game    games process:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.  ","gametype":"","url":"https://h5-cdn.aifreegame.com/the-princesses-prom-costume/","tags":"","cat":37,"title":"The Princesses' Prom Costume","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14033.jpg","played":"","date":""},{"desc":"  games intro:    The princess's birthday is coming, so she wants to make her own cake for himself, now there is only the decoration link, let's help the princess decorate this delicious cake!    games playing:    mouse action     games target:    Decorate delicious cakes.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/princess-makes-delicious-cake/","tags":"","cat":37,"title":"Princess Makes Delicious Cake","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14035.jpg","played":"","date":""},{"desc":"Ice Queen Romantic Date\r\nGo on a romantic date with one of your favorite couples! The Ice Queen and her boyfriend want to have an unforgettable date. The red hearts are hidden in different places so first you have to find them, this will help you set the right mood. Try on different outfits for the cute love birds and then have fun surrounding them with decorations.\r\n\r\nHow to Play Ice Queen Romantic Date\r\nUse your mouse to play.","gametype":"","url":"https://h5-cdn.aifreegame.com/ice-queen-romantic-date/","tags":"","cat":37,"title":"Ice Queen Romantic Date","img":"/cover/8193_333264.jpg","played":"","date":""},{"desc":"Ice Queen New Year Makeover is among the great free games in aifreegame.com. Play Ice Queen New Year Makeover and Pick your best Friv 1000 game in the amazing long list without any charges.","gametype":"","url":"http://html5.gamedistribution.com/474ceb2d6acf4ac0b95ee94526aae439/","tags":"","cat":37,"title":"Ice Queen New Year Makeover","img":"/cover/8591.png","played":"","date":""},{"desc":"  games intro:    The mermaid has grown up and ushered in the coronation of her life. In the game, players can freely dress up the mermaid princess in the coronation, so that she can meet the coronation ceremony.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/mermaid-princess-coronation/","tags":"","cat":37,"title":"Mermaid Princess Coronation","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14042.jpg","played":"","date":""},{"desc":"This free game entitled Elsa Gift Shopping is a very great game which is available on www.AiFreeGame.com absolutely for free. Elsa Gift Shopping is both the frozen and other and also one-player game. This is an HTML5 game and it can be played on any mobile device. The controlls are easy, just use your finger on mobile and mouse and keyboard on PC to beat the score. Have fun playing Elsa Gift Shopping online game for free on our site.","gametype":"","url":"http://html5.gamedistribution.com/eb20765b4b0947079a3d0291390c492d/","img":"/cover/8409.png","title":"Elsa Gift Shopping","date":"","tags":"","cat":37,"played":""},{"desc":"This mobile game which name is Shimmer And Shine Wardrobe Cleaning is genuinely exciting game which is available on AiFreeGame.com absolutely for free. Shimmer And Shine Wardrobe Cleaning has a vast list of categories, for example baby and other and many more such as cleaning, dress-up, one-player games as well. This is an HTML5 game and it can be played on tablets and mobile phones. To controll use your finger on mobile and mouse and keyboard on PC and win medals in this game. Take pleasure playing Shimmer And Shine Wardrobe Cleaning online game for free on our site.","gametype":"","url":"https://h5-cdn.aifreegame.com/shimmer-and-shine-wardrobe-cleaning/","tags":"","cat":37,"title":"Shimmer And Shine Wardrobe Cleaning","img":"/cover/8214.png","played":"","date":""},{"desc":"  games intro:    The princess and her boyfriend agreed to meet, but she was stopped by her mother, who refused to go out for a date. This could not stop the princess's pace, dress up for the right time to go out, and must not be found out by her mother.    games playing:    mouse action     games target:    Go out on a date successfully.    games process:    When the game is loaded, click the PLAY button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/the-princesss-secret-date/","tags":"","cat":37,"title":"The Princess's Secret Date","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14043.jpg","played":"","date":""},{"desc":"Join your favorite couples for the New Year Party and help them find the perfect outfits Try on amazing dresses hairstyles and cool accessories for the girls they need to look stunning tonight Dont forget about the boys too pick an elegant costume for each of them and let the party begin Happy New Year.","gametype":"","url":"https://h5-cdn.aifreegame.com/couples-new-year-party/","img":"/cover/8271_644364.jpg","title":"Couples New Year Party","date":"","tags":"","cat":37,"played":""},{"desc":"  games intro:    It was another lazy day, and the princess was lying ready to enjoy the SPA button. Let's start with facial and back care to help the princess with beautiful makeup, and finally with beautiful clothes. The new princess will meet you right away.    games playing:    mouse action     games target:    Successful SPA. for Princess    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/blonde-princess-massage-makeup/","tags":"","cat":37,"title":"Blonde Princess Massage Makeup","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14037.jpg","played":"","date":""},{"desc":"This mobile game named Ellie Vogue Blog is truly exciting game which is available on GekoGames absolutely for free. Ellie Vogue Blog has a vast list of categories, for example one-player and dress-up and many more such as fashion, girls games as well. This is an HTML5 game so all you need is a browser to run it. You only need your finger on mobile and mouse and keyboard on PC to gain achievements in this game. Have fun playing Ellie Vogue Blog online game for free now.","gametype":"","url":"https://h5-cdn.aifreegame.com/ellie-vogue-blog/","img":"/cover/8345.png","title":"Ellie Vogue Blog","date":"","tags":"","cat":37,"played":""},{"desc":"  games intro:    The princesses are preparing for a special party, but they want to make trouble with Princess An Na. The player's task is to help An Na properly dress up and pass the princess's test and finally complete the interview.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161213/j9/index.htm","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14050.jpg","title":"Princess Sorority","date":"","tags":"","cat":37,"played":""},{"desc":"Hey ladies Barbie has found a brand new passion She has recently become a Hollywood actress and all of the paparazzi are chasing her to get the best shots of her Tonight she is going to the Oscars and she must look absolutely amazing In our exciting new dress up game called Barbie Party Diva you are going to have the task of helping gorgeous Barbie get her outfit ready for the Party event Have fun.","gametype":"","url":"http://html5.gamedistribution.com/a30f3aac95574de8ad82da8c97908556/","tags":"","cat":37,"title":"Barbie Party Diva","img":"/cover/8195.png","played":"","date":""},{"desc":"This browser game named Couples Love Album is truly great game which is available on our site absolutely for free. Couples Love Album has a vast list of categories, for example one-player and girls and many more such as cartoon, kissing, love, dress-up games as well. This is an HTML5 game and it is fully supported by mobile phones. To operate, just use your finger on mobile and mouse and keyboard on PC to beat the score. Feel yourself at home playing Couples Love Album online game for free on our site.","gametype":"","url":"https://h5-cdn.aifreegame.com/couples-love-album/","tags":"","cat":37,"title":"Couples Love Album","img":"/cover/8074.png","played":"","date":""},{"desc":"  games intro:    Issa of Frozen is preparing for a new look for the New year. Let's do a facial care for Elsa first, and then dress up the princess in a beautiful dress!    games playing:    Mouse operation, mouse click, reasonable operation.    games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161223/t1a/y/index.html","tags":"","cat":37,"title":"Snow Princess New Year Dress","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14060.jpg","played":"","date":""},{"desc":"This fine game which name is Dress your Barbie for a Wedding is genuinely fun game which is available on Geko absolutely for free. Dress your Barbie for a Wedding has a vast list of categories, for example one-player and barbie and many more such as kids, dress-up, make-up, makeover, princess, wedding games as well. This is an HTML5 game and it can be played on any mobile device. Start with using your finger on mobile and mouse and keyboard on PC to gain achievements in this game. Enjoy playing Dress your Barbie for a Wedding online game for free here.","gametype":"","url":"https://h5-cdn.aifreegame.com/dress-your-barbie-for-a-wedding/","tags":"","cat":37,"title":"Dress your Barbie for a Wedding","img":"/cover/8134.png","played":"","date":""},{"desc":"This fine game entitled Ice Queen Nails Spa is definitely excellent game which is available on www.AiFreeGame.com absolutely for free. Ice Queen Nails Spa has a vast list of categories, for example frozen and other and many more such as make-up, one-player games as well. This is an HTML5 game and it is fully compatible with your device. You only need your finger on mobile and mouse and keyboard on PC in this game. Feel yourself at home playing Ice Queen Nails Spa online game for free now.","gametype":"","url":"https://h5-cdn.aifreegame.com/ice-queen-nails-spa/","tags":"","cat":37,"title":"Ice Queen Nails Spa","img":"/cover/8249.png","played":"","date":""},{"desc":"  games intro:    The school day will come again, but we do not know the princess has his favorite boy. Hurry to dress themselves, so that they can shine in front of the boys, then is to confess, decorate your love letters, let the boys feel the love of the princess!    games playing:    mouse action     games target:    Dress up and show success.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/princesss-campus-love/","tags":"","cat":37,"title":"Princess's Campus Love","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14044.jpg","played":"","date":""},{"desc":"  games intro:    The princess's own garden was very messy, so an activity of cleaning the garden began. First of all, dress up and clean the park and start cleaning the garden!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161111/j4/index.html","tags":"","cat":37,"title":"Princess Working In The Park","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14025.jpg","played":"","date":""},{"desc":"  games intro:    Detective Princess wanted to find out who was behind the burglary, by looking for lost objects step by step, finally can know the killer's characteristics, according to the characteristics to find out who is the real prisoner!    games playing:    mouse action     games target:    Find the last prisoner.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161128/t1/index.html","tags":"","cat":37,"title":"Detective Princess To Investigate","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14038.jpg","played":"","date":""},{"desc":"If you are a person of challenges this princess game should change the way you think and for sure is a proper one when it comes to choosing how to spend your free time This time you will be taking care of the carriage that belongs to a beautiful princess and she needs your help to clean the vehicle so she could walk in it in the whole kingdom Accomplish all the given task and use your imagination to design","gametype":"","url":"http://html5.gamedistribution.com/6a910b8c018747f39fc136a2964c9dea/","tags":"","cat":37,"title":"Princess Carriage Car Wash","img":"/cover/8781_570636.jpg","played":"","date":""},{"desc":"  games intro:    Pregnant princesses want to go out, how to match the most fashionable maternity outfits? As a costume collocation teacher, hurry up for the princesses to give advice, dress up the most fashionable pregnant women dress up!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161110/t2a/index.html","tags":"","cat":37,"title":"Pregnant Princess Fashion Costume","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14024.jpg","played":"","date":""},{"desc":"This free game which name is Frozen Wedding Ceremony is rightly exciting game which is available on AiFreeGame.com absolutely for free. Frozen Wedding Ceremony has a vast list of categories, for example frozen and other and many more such as dress-up, wedding, one-player games as well. This is an HTML5 game so it is fully supported by your device. To controll use your finger on mobile and mouse and keyboard on PC in this game. Have fun playing Frozen Wedding Ceremony online game for free on GekoGames.","gametype":"","url":"https://h5-cdn.aifreegame.com/frozen-wedding-ceremony/","tags":"","cat":37,"title":"Frozen Wedding Ceremony","img":"/cover/8200.png","played":"","date":""},{"desc":"Enter the Ice Kingdom and help two cute sisters reorganize their closets! Gather up the outfits they need, sort them out and throw away the old clothes. Now it's dress up...","gametype":"","url":"http://html5.gamedistribution.com/6f741dc21ce14cab8b27931cf5b25c11/","tags":"","cat":37,"title":"Ice Kingdom Wardrobe Cleaning","img":"/cover/8956.png","played":"","date":""},{"desc":"This browser game entitled Elsa Secret Transform is surely exciting game which is available on www.AiFreeGame.com absolutely for free. Elsa Secret Transform has a vast list of categories, for example frozen and arcade and many more such as one-player, hidden-objects games as well. This is an HTML5 game and games like these has no problems running on mobile phones. You only need your finger on mobile and mouse and keyboard on PC in this game. Feel yourself at home playing Elsa Secret Transform online game for free on this site.","gametype":"","url":"http://html5.gamedistribution.com/9fae2012014a468683fe7f5f3da09e3f/","tags":"","cat":37,"title":"Elsa Secret Transform","img":"/cover/8421.png","played":"","date":""},{"desc":"This online game which title is Frozen Stages Of Love is truly fun game which is available on GekoGames absolutely for free. Frozen Stages Of Love has a vast list of categories, for example frozen and other and many more such as dating, one-player games as well. This is an HTML5 game and it can be played on any mobile device. To operate, just use your finger on mobile and mouse and keyboard on PC and win medals in this game. Take pleasure playing Frozen Stages Of Love online game for free now.","gametype":"","url":"http://html5.gamedistribution.com/887a7f8fc89c41c99172968cf1a1b8ed/","tags":"","cat":37,"title":"Frozen Stages Of Love","img":"/cover/8276.png","played":"","date":""},{"desc":"  games intro:    Princess Sleeping Beauty always wants to play a role, this time he wants to challenge the role of the witch queen, starting with the production of clothing, making is the makeup link, role play together to create the most perfect image of the queen.    games playing:    mouse action     games target:    Successful completion of cosplay.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/sleeping-beauty-princess-role-play/","tags":"","cat":37,"title":"Sleeping Beauty Princess Role Play","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14045.jpg","played":"","date":""},{"desc":"As the summer days get hotter and hotter these Disney girls are looking for new ways to cool off and Ariel came up with a this cool idea of having a pool party. Everyone ...","gametype":"","url":"http://html5.gamedistribution.com/c0eb3d62b1354141bf8786dba972ab1a/","tags":"","cat":37,"title":"Princess Pool Party Floats","img":"/cover/8735.png","played":"","date":""},{"desc":"Fairytale party is coming and our Ellie isn't prepared. Do you want to help her to have a perfect look at this meeting? She must to have a fairytale look starting with he...","gametype":"","url":"http://html5.gamedistribution.com/3ebc4ad1d95f4e449ba6bbc5cc252cd6/","tags":"","cat":37,"title":"Ellie Fairytale Princess","img":"/cover/8688.png","played":"","date":""},{"desc":"  games intro:    Princess Rachel suddenly wanted to go shopping and buy some clothes she liked. As her best friend, let's help her choose the most beautiful and fashionable clothes! Help Princess Rachel with her most beautiful look.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/princess-rachel-shopping/","tags":"","cat":37,"title":"Princess Rachel Shopping","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14036.jpg","played":"","date":""},{"desc":"  games intro:    The princesses began to work as detectives. They would not let go of any trace of the criminal elements. In the game, the player's goal was to find out the clues of each level, and to find out all the clues in the prescribed time to get through the border. Let's find out who's behind the scenes!    games playing:    mouse action     games target:    Succeed in finding clues.    games process:    When the game is loaded, click the PLAY button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/princess-detective/","tags":"","cat":37,"title":"Princess Detective","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14020.jpg","played":"","date":""},{"desc":"  games intro:    The princesses began their runway show, and the player's task was to dress up our princess properly, to face the judges and the audience in the best form, and finally to select the most beautiful princess.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161227/t3/index.html","tags":"","cat":37,"title":"The Princesses' Catwalk Shows","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14061.jpg","played":"","date":""},{"desc":"  games intro:    Christmas is coming quietly, the princesses are preparing to do some interesting activities on this day, An Na's ghost ideas the most, so in order to complete the activities, the whole trip is essential, together to reasonably dress up, in the activities to have fun!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20170106/t5/index.html","tags":"","cat":37,"title":"The Princess's Christmas","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14069.jpg","played":"","date":""},{"desc":"Five girls are fighting for the first place in our dress up competition.Help them pick some beautiful outfits for specific events and see what the judge's have to say.Hav...","gametype":"","url":"http://html5.gamedistribution.com/4eee2cfe3687464c9e23b86b105474e6/","tags":"","cat":37,"title":"Dress Up Competition","img":"/cover/8901.png","played":"","date":""},{"desc":"  games intro:    The princesses had been waiting, finally, for the day of the red carpet. In the game, the player's task is to dress up beautiful princesses, so that they can shine on the red carpet, become the focus of attention.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"https://h5-cdn.aifreegame.com/the-princess-dressed-up-on-the-red-carpet/","tags":"","cat":37,"title":"The Princess Dressed Up On The Red Carpet","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14041.jpg","played":"","date":""},{"desc":"Beautiful princess said 'yes!' to her beloved prince and now she is waiting for a big and important day – her WEDDING DAY! Show your expert wedding planning talent and ...","gametype":"","url":"http://html5.gamedistribution.com/89b51acda65a40f8940b9d7e5b5453aa/","tags":"","cat":37,"title":"Ice Princess Wedding Day","img":"/cover/8836.png","played":"","date":""},{"desc":"A full day of shopping can be so much fun! Join the Ice Queen and help her get money before going to the mall. She needs a whole new wardrobe so collect as many bills as ...","gametype":"","url":"http://html5.gamedistribution.com/7d1fe247d78244c18250e16fbb344e4c/","tags":"","cat":37,"title":"Ice Queen Realife Shopping","img":"/cover/8726.png","played":"","date":""},{"desc":"Dotted Girl had a really tough week, but now she wants to totally relax! Help her get ready for an amazing sauna experience. Get rid of the jewelry, change her into somet...","gametype":"","url":"https://h5-cdn.aifreegame.com/super-girls-sauna-realife/","tags":"","cat":37,"title":"Super Girls Sauna Realife","img":"/cover/9042.png","played":"","date":""},{"desc":"This fine game named Princess Doll House Decoration is honestly neat game which is available on GekoGames absolutely for free. Princess Doll House Decoration is a baby game. This is an HTML5 game and it can be played on tablets and mobile phones. Start with using your finger on mobile and mouse and keyboard on PC to beat the score. Take pleasure playing Princess Doll House Decoration online game for free on GekoGames.","gametype":"","url":"http://html5.gamedistribution.com/6de1ac3396964eee8e78b04015cd708a/","tags":"","cat":37,"title":"Princess Doll House Decoration","img":"/cover/8337.png","played":"","date":""},{"desc":"  games intro:    It was a grand celebration, and all the princesses were ready to go. In the game, the player's task is to help the princesses dress up and dress up, so that they can dress up, and act quickly!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161221/t9a/index.htm","tags":"","cat":37,"title":"Princess Winter Celebration","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14057.jpg","played":"","date":""},{"desc":"It's summer and the Ice Princess is planning to spend the entire day at the pool. She can't wait to get tanned and go for a swim, but before that she has to look stunning...","gametype":"","url":"http://html5.gamedistribution.com/78fae0a89dd940ceb46498edece906d5/","tags":"","cat":37,"title":"Ice Princess Pool Time","img":"/cover/9024.png","played":"","date":""},{"desc":"  games intro:    Princess Elsa has come to the Las Vegas casino, and this time she's coming here to take a chance. Let's help her find her luck card and the cards she needs!    games playing:    mouse action     games target:    Find out everything.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp19/ssj/20161012/j6/index.htm","tags":"","cat":37,"title":"Princess Casino Night","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14021.jpg","played":"","date":""},{"desc":"Anna and Elsa have been accepted in the newest season of Masterchef, the most famous competition for chefs worldwide. Preparations are intense and the two princesses need...","gametype":"","url":"http://html5.gamedistribution.com/122734eee744431c906b7a355a696f21/","tags":"","cat":37,"title":"Princesses Masterchef Contestants","img":"/cover/8994.png","played":"","date":""},{"desc":"Help this beautiful girl get ready for the perfect selfie! To get started you need to clean up her phone a little because she dropped it on her way home. Use the hair dry...","gametype":"","url":"http://html5.gamedistribution.com/6956c35628e44d7eb442144a0f890ade/","tags":"","cat":37,"title":"Fashion Selfie Addiction","img":"/cover/8664.png","played":"","date":""},{"desc":"  games intro:    The princesses were invited to a party in the castle. As a result, the princesses began to dress up, as their designers, hurry to dress up for them, so that they can surprise the audience!    games playing:    Mouse operation, the game is loaded by clicking the play button to start the game    games target:        games process:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161202/t2/index.html","tags":"","cat":37,"title":"The Princesses' Castle Dress","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14046.jpg","played":"","date":""},{"desc":"  games intro:    The Latin princess takes care of her face once a week. Today she has time to take care of her face. Now let's help her take care of herself and make herself beautiful.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161216/j2/index.html","tags":"","cat":37,"title":"Latin Princess Face Care","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14054.jpg","played":"","date":""},{"desc":"  games intro:    The two sisters of Frozen celebrated on their coronation. Now let's dress up the sisters and make their coronation more splendid and magnificent.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161209/1/index.html","tags":"","cat":37,"title":"Princess Coronation Day","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14048.jpg","played":"","date":""},{"desc":"  games intro:    The princesses have been in school for some time. They already have their own fashionable costumes. Now let's make their own college fashions for them!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161108/t4/index.htm","tags":"","cat":37,"title":"Princess's Modern College Time","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14022.jpg","played":"","date":""},{"desc":"Four of your favourite Disney Princesses are getting ready to attend the annual Mermaid Parade on New York’s Coney Island. It’s one of the most awaited summer festiva...","gametype":"","url":"http://html5.gamedistribution.com/4beafbe614cc41f0905b36877d421fda/","tags":"","cat":37,"title":"Princess Mermaid Parade","img":"/cover/8731.png","played":"","date":""},{"desc":"This fine game which title is Scary Cabin Halloween is truly good game which is available on AiFreeGame.com absolutely for free. Scary Cabin Halloween is a frozen game. This is an HTML5 game so you do not need any additional soft to play it. You only need your finger on mobile and mouse and keyboard on PC to navigate through the game. Have fun playing Scary Cabin Halloween online game for free on our site.","gametype":"","url":"http://html5.gamedistribution.com/063fecc95a7c43ab8129dbead0f6896b/","tags":"","cat":37,"title":"Scary Cabin Halloween","img":"/cover/8064.png","played":"","date":""},{"desc":"Hey, girls! Spring days become warmer and the sun is shining bright. It means, your favorite princess is looking for a new spring trends! Let’s join her and try to find...","gametype":"","url":"https://h5-cdn.aifreegame.com/princess-new-spring-trends/","tags":"","cat":37,"title":"Princess New Spring Trends","img":"/cover/8495.png","played":"","date":""},{"desc":"  games intro:    The princesses have been unable to restrain their desire to shop, see the array of jackets in the mall, the princesses began to dress up, together to give them the most fashionable casual jacket dress up!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161230/j2/index.htm","tags":"","cat":37,"title":"Princesses' Fashionable Leisure Jackets","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14063.jpg","played":"","date":""},{"desc":"Girls, your favorite princesses love fashion. They are searching for new and amazing trends and they have found something amazing. While browsing online, Elsa Frozen has ...","gametype":"","url":"http://html5.gamedistribution.com/e6d4478615884bbea5c71a0edd842040/","tags":"","cat":37,"title":"Princess Fashion Puffer Jacket","img":"/cover/8506.png","played":"","date":""},{"desc":"The Royal Ball is about to start, but Cinderella can't find her shoes! They hold magic powers and without them she won't be able to have a beautiful dress and attend the ...","gametype":"","url":"http://html5.gamedistribution.com/c281271046a04cd59e3edd96ba50ace0/","tags":"","cat":37,"title":"Cinderella Princess Transform","img":"/cover/8644.png","played":"","date":""},{"desc":"Hello dear friends! In this wonderful new game you have the chance to meet two beautiful pregnant princesses.They decided that it's time for a new fashion look. In this w...","gametype":"","url":"http://html5.gamedistribution.com/df32d29dfc224a38b1ad7d0b7665aa92/","tags":"","cat":37,"title":"Pregnant Princesses Fashion Outfits","img":"/cover/8859.png","played":"","date":""},{"desc":"Rapunzel, aside from being a princess, is an average student girl who has her daily routine. First of all, Rapunzel has a nutritious breakfast full of vitamins. The next ...","gametype":"","url":"http://html5.gamedistribution.com/1086b66cc8764cdc8d9eabf095116d33/","tags":"","cat":37,"title":"Day Routine with Princess","img":"/cover/8851.png","played":"","date":""},{"desc":"Oh no, no, no! It’s the first day of school and Jenny… well, she’s running just a bit late! Her hair is all messed up, she still needs to decide on her outfit and s...","gametype":"","url":"http://html5.gamedistribution.com/465e921352da443b8f7eb0e38b06bc86/","tags":"","cat":37,"title":"Late to School Hairstyles","img":"/cover/9037.png","played":"","date":""},{"desc":"Tris and Dove want to have a full night of fun role-playing and trying on different costumes. Want to see what they are up to? Open up the boxes and you will find the mos...","gametype":"","url":"http://html5.gamedistribution.com/0faf970d046d463fb93d95a71da1f8f2/","tags":"","cat":37,"title":"Dolly Role Play Dress Up","img":"/cover/8788.png","played":"","date":""},{"desc":"Disney princess Cinderella is always one step ahead of the fashion trends. That’s why Cinderella decided to make her wedding the most unusual way… or not? And you are...","gametype":"","url":"http://html5.gamedistribution.com/2922a4149e344d738d32ae6a05a3b022/","tags":"","cat":37,"title":"Princess Wedding: Classic or Unusual","img":"/cover/8686.png","played":"","date":""},{"desc":"This browser game titled Mermaid Melody is quite fun game which is available on www.AiFreeGame.com absolutely for free. Mermaid Melody has a vast list of categories, for example one-player and mermaid and many more such as dress-up, girls games as well. This is an HTML5 game and any browser can play it. The controlls are easy, just use your finger on mobile and mouse and keyboard on PC to navigate through the game. Have fun playing Mermaid Melody online game for free now.","gametype":"","url":"http://html5.gamedistribution.com/96b6eba82b2342bf841b11dd54583ce0/","img":"/cover/8325.png","title":"Mermaid Melody","date":"","tags":"","cat":37,"played":""},{"desc":"Join our two princesses at their cooking contest! Today it's donuts day and they have to decorate the donuts,to make them delicious and good looking to win the prize.Help...","gametype":"","url":"http://html5.gamedistribution.com/137665433629485eafdc139c9f649e62/","img":"/cover/8858.png","title":"Princesses Cooking Contest","date":"","tags":"","cat":37,"played":""},{"desc":"Today is a great sunny day and our beautiful princesses decided to visit the water park.To look great and get a nice tan,they want to visit the water park shop first, to ...","gametype":"","url":"http://html5.gamedistribution.com/de821e9f7303490ca9f5e732c3cb2cfc/","tags":"","cat":37,"title":"Water Park Fun","img":"/cover/8753.png","played":"","date":""},{"desc":"This new game which title is Winter Ice Skating is genuinely fun game which is available on GekoGames absolutely for free. Winter Ice Skating has a vast list of categories, for example winter and cartoon and many more such as dress-up, one-player games as well. This is an HTML5 game and it can be played on any mobile device. All you need is your finger on mobile and mouse and keyboard on PC to beat the score. Be our guest playing Winter Ice Skating online game for free on this site.","gametype":"","url":"http://html5.gamedistribution.com/9e277f6d7dae42e8a3fa1768975d5511/","img":"/cover/8187.png","title":"Winter Ice Skating","date":"","tags":"","cat":37,"played":""},{"desc":"Ariel, Jasmine and Belle haven’t seen each other for ages. Finally, the day of their great reunion has come! Ariel suggests having some fun activities together, and eve...","gametype":"","url":"http://html5.gamedistribution.com/89c3681ce49c4df4ab8d5b7f10fe773d/","img":"/cover/8972.png","title":"Princesses Great Reunion","date":"","tags":"","cat":37,"played":""},{"desc":"  games intro:    The princesses are going to a makeup Christmas party, now let's help the princesses paint the makeup of their faces, so that they can surprise the scene, hurry up to action!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161216/3/index.html","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14053.jpg","title":"Christmas Facial Painting","date":"","tags":"","cat":37,"played":""},{"desc":"  games intro:    Elsa accepted the invitation of the elves in the forest and was ready to go to their party. Let's help Aisha dress up and dress up for the party!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://h5-cdn.aifreegame.com/elsa-elf-princess-party/","tags":"","cat":37,"title":"Elsa Elf Princess Party","img":"/cover/9808_928792.jpg","played":"","date":""},{"desc":"This mobile game which title is Fabulous Fashionista Dress Up is actually good game which is available on www.AiFreeGame.com absolutely for free. Fabulous Fashionista Dress Up has a vast list of categories, for example one-player and dress-up and many more such as fashion, girls games as well. This is an HTML5 game so you do not need any additional soft to play it. To controll use your finger on mobile and mouse and keyboard on PC to be the best at this game. Enjoy playing Fabulous Fashionista Dress Up online game for free on www.AiFreeGame.com.","gametype":"","url":"http://html5.gamedistribution.com/61d5397d46ae4eb89ca730462a5b7556/","tags":"","cat":37,"title":"Fabulous Fashionista Dress Up","img":"/cover/8280.png","played":"","date":""},{"desc":"  games intro:    In winter, the two princesses had inexhaustible words, one princess chitchat began, let us first set up the room, waiting for the arrival of the other princess. After tea, the princesses went out to help them dress up so they could go out warm.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161220/t5/index.html","tags":"","cat":37,"title":"The Princess's Winter Story","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14055.jpg","played":"","date":""},{"desc":"Your favorite mystery boxes are back with Homecoming dresses for awesome Dolly Tris! Practice your fashion skills by creating a stunning look for Tris and don't forget to...","gametype":"","url":"https://h5-cdn.aifreegame.com/tris-homecoming-dolly-dressup-h5/","tags":"","cat":37,"title":"Tris Homecoming Dolly Dressup H5","img":"/cover/8730.png","played":"","date":""},{"desc":"Headmistress Lady Tremaine is preparing a fabulous prom ball at her Princess High School. Start with choosing a theme for the ball. Then help princesses Cinderella and Ja...","gametype":"","url":"http://html5.gamedistribution.com/c11abfd29e4d9b4d4b566b01114d8486/","tags":"","cat":37,"title":"Prom Ball at Princess School","img":"/cover/8767.png","played":"","date":""},{"desc":"  games intro:    Princess Sleeping Beauty lost a lot of things, now let's help her find the missing things! Get all the things back and dress up for the Sleeping Beauty and move!    games playing:    mouse action     games target:    Find all the items and dress up for the Sleeping Beauty.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161117/x1/index.html","tags":"","cat":37,"title":"Sleeping Beauty's Wardrobe","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14031.jpg","played":"","date":""},{"desc":"Our beautiful princesses are going this summer to an exotic place in Hawaii. In the first day here they decided that today is a perfect day to relax at the pool and try o...","gametype":"","url":"http://html5.gamedistribution.com/9d70dd0d92d040808587775b3b6c280d/","tags":"","cat":37,"title":"Princesses Summer Vacation Trend","img":"/cover/9008.png","played":"","date":""},{"desc":"Young Fashion store is having final reductions today! Ariel has to hurry up to purchase fashionable clothes, shoes and accessories at a discount! Pick some trendy outfits...","gametype":"","url":"http://html5.gamedistribution.com/405da5209cdf4efbb51aef1cefe71c30/","tags":"","cat":37,"title":"Princess Haul: Young Fashion","img":"/cover/8853.png","played":"","date":""},{"desc":"After a long week of fighting villains and keeping the town safe, Miraculous Ladybug went to the sauna for some relaxation. Help her get ready first, change her outfit in...","gametype":"","url":"http://html5.gamedistribution.com/d5c9e4e4512841b79fed4d2a363f5ce2/","tags":"","cat":37,"title":"Ladybug Sauna Realife","img":"/cover/8978.png","played":"","date":""},{"desc":"What could give more fun than hosting an amazing party while also making a good deed? Today Princess College is going to make a grand Charity Ball! Yay! Elsa and Belle ar...","gametype":"","url":"http://html5.gamedistribution.com/fbfce26b593e4169b539af8c4e2503b0/","tags":"","cat":37,"title":"Princess Charity Day","img":"/cover/8948.png","played":"","date":""},{"desc":"Gigi and Ariana are going to beat Tiana and Aurora in a fashion competition, or vice versa? The final decision is up to you, girl. Glitter, lace, luxurious or simple roma...","gametype":"","url":"http://html5.gamedistribution.com/f0b4c5d06d6344019f24a67f40241a4d/","tags":"","cat":37,"title":"Princesses VS Celebs Fashion Challenge","img":"/cover/8660.png","played":"","date":""},{"desc":"The most exciting challenge is the new game for girls called Princess Match Accessory. Girls know how difficult it is to have a perfect outfit and that many times an acce...","gametype":"","url":"http://html5.gamedistribution.com/6074692d593c4a4ab6fb52cc46333ee9/","tags":"","cat":37,"title":"Princess Match Accessory","img":"/cover/8670.png","played":"","date":""},{"desc":"  games intro:    The princesses were dressing themselves up as they were about to become magazine cover girls. In the game, the player's task is to help them dress up so that they are most beautiful on the magazine.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161214/1/index.html","tags":"","cat":37,"title":"Princess Fashion Magazine","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14051.jpg","played":"","date":""},{"desc":"  games intro:    The princesses, prepared to report a masquerade party, are now agonizing over how to dress up to surprise the four? Now let's help the princesses dress up for the most beautiful masquerade party!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161117/j3/y/index.html","tags":"","cat":37,"title":"Princess's Makeup Party","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14029.jpg","played":"","date":""},{"desc":"Tomorrow Ariel and Eric are getting married! Princess Ariel is very much fond of festival fashion, so when it came to choosing a wedding theme, there was no other option ...","gametype":"","url":"http://html5.gamedistribution.com/96e58640c6064a4696f94cd15d0fdaff/","tags":"","cat":37,"title":"Princess Coachella Inspired Wedding","img":"/cover/8784.png","played":"","date":""},{"desc":"This sweet lovely Mermaid Princess decided that she want s to have a new gorgeous makeup for this hot summer. Help her choose the perfect color for her make up in this be...","gametype":"","url":"http://html5.gamedistribution.com/80f91b4b2904445fa4c6776ad8db3dc4/","tags":"","cat":37,"title":"Princess Summer Make UP","img":"/cover/9078.png","played":"","date":""},{"desc":"Princess Emma are going to get married today. But she is looking for the best hairstylist in the world for her bridal hairstyle today. Will you interested to be her brida...","gametype":"","url":"http://html5.gamedistribution.com/1ba47b6c1b484cf29f6d6e66a62988bb/","tags":"","cat":37,"title":"Princess Bridal Hairstyle","img":"/cover/8614.png","played":"","date":""},{"desc":"  games intro:    For the annual Christmas, the princesses began to draw a scary costume, zombie theme is very good, let's dress up for the princesses one of the most scary zombie dress!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161109/t1/index.htm","tags":"","cat":37,"title":"Princess's Zombie Costume","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14023.jpg","played":"","date":""},{"desc":"Design beautiful sneakers and shoes for a special fashion event.Choose colors,designs,patterns and create exclusive shoes and sneakers that will be voted by a jury.Have f...","gametype":"","url":"http://html5.gamedistribution.com/c0dd1cc519804d1e9b503f4a464c9166/","tags":"","cat":37,"title":"Princess Sneakers Design","img":"/cover/8916.png","played":"","date":""},{"desc":"This free game entitled Halloween Face Art is surely excellent game which is available on AiFreeGame.com absolutely for free. Halloween Face Art is a princess game. This is an HTML5 game and games like these has no problems running on mobile phones. To controll use your finger on mobile and mouse and keyboard on PC to gain achievements in this game. Have a good time playing Halloween Face Art online game for free on Geko.","gametype":"","url":"http://html5.gamedistribution.com/8af30bdbd7f74553823db513ced4725d/","img":"/cover/8256.png","title":"Halloween Face Art","date":"","tags":"","cat":37,"played":""},{"desc":"  games intro:    The princesses gather together to give each other some special Christmas surprises, prepare special gifts according to each princess's hobbies, and dress up with your gifts!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    After loading the game, you can start the game by clicking the play button twice  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161221/t11a/index.htm","tags":"","cat":37,"title":"The Princess's Secret Christmas Present","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14058.jpg","played":"","date":""},{"desc":"In Princess Prom Photoshoot you must give this cute girl a complete makeover. She's going on a date! Dress her up with a lovely outfit, a gorgeous hairstyle and much more...","gametype":"","url":"http://html5.gamedistribution.com/5d2c1b893df94880886ce49e70aa9a14/","img":"/cover/8631.png","title":"Princess Prom Photoshoot","date":"","tags":"","cat":37,"played":""},{"desc":"Join the mermaid princess and be prepared to have some fun at the pool! The princess is planning to spend the entire day there and she needs to look good. Together you ca...","gametype":"","url":"http://html5.gamedistribution.com/dd2294c14f6a493d9d9f314ba05ab1d8/","tags":"","cat":37,"title":"Mermaid Princess Pool Time","img":"/cover/8612.png","played":"","date":""},{"desc":"This new game entitled Girls Photo Shopping Dress-up is honestly pleasant game which is available on AiFreeGame.com absolutely for free. Girls Photo Shopping Dress-up has a vast list of categories, for example dress-up and fashion and many more such as shopping, girls games as well. This is an HTML5 game so it is compatible with mobile phones and tablets. Use your finger on mobile and mouse and keyboard on PC to gain achievements in this game. Enjoy playing Girls Photo Shopping Dress-up online game for free now.","gametype":"","url":"http://html5.gamedistribution.com/7a174a197cea4039ad4b8cb65880de7c/","img":"/cover/8146_814682.jpg","title":"Girls Photo Shopping Dress up","date":"","tags":"","cat":37,"played":""},{"desc":"All girls dream about awesome double wedding to share their happiness with the closest BFF, and the princesses make no exception! The lovely princesses are both getting m...","gametype":"","url":"http://html5.gamedistribution.com/9b124ac0b70e4e18b0a5f2865ccd63eb/","tags":"","cat":37,"title":"Princesses Double Boho Wedding","img":"/cover/8583.png","played":"","date":""},{"desc":"These two gorgeous mermaids are BFFs and they want to spend some quality time together. What better place to relax then the sauna? Join the two lovely mermaids in a reali...","gametype":"","url":"http://html5.gamedistribution.com/852923a8c6d94464823bf9465923b32d/","img":"/cover/8655.png","title":"Mermaids Bffs Realife Sauna","date":"","tags":"","cat":37,"played":""},{"desc":"This browser game titled Sally Shopping Mall Trip is genuinely fun game which is available on our site absolutely for free. Sally Shopping Mall Trip has a vast list of categories, for example one-player and girls and many more such as shopping, fashion, dress-up games as well. This is an HTML5 game so it runs on any device you like. All you need is your finger on mobile and mouse and keyboard on PC and win medals in this game. Enjoy playing Sally Shopping Mall Trip online game for free on our site.","gametype":"","url":"http://html5.gamedistribution.com/3736d6d213d14c6795c552712c2daa13/","tags":"","cat":37,"title":"Sally Shopping Mall Trip","img":"/cover/8267.png","played":"","date":""},{"desc":"This mobile game entitled Ariel Princess VS Mermaid is surely exciting game which is available now absolutely for free. Ariel Princess VS Mermaid has a vast list of categories, for example one-player and girls and many more such as mermaid, princess, dress-up games as well. This is an HTML5 game so you do not need any additional soft to play it. Use your finger on mobile and mouse and keyboard on PC to gain achievements in this game. Have fun playing Ariel Princess VS Mermaid online game for free here.","gametype":"","url":"http://html5.gamedistribution.com/bb2dec285775496f808984e40e296716/","tags":"","cat":37,"title":"Ariel Princess VS Mermaid","img":"/cover/8081.png","played":"","date":""},{"desc":"The big day is coming and our princess needs to look flawless because she is the next bride featured on the cover of a famous magazine! Try on stunning wedding dresses, v...","gametype":"","url":"http://html5.gamedistribution.com/10dd1010f4674d798d636a9b57c2a5dd/","tags":"","cat":37,"title":"Princess Bride Magazine","img":"/cover/8658.png","played":"","date":""},{"desc":"This browser game named Ellie Pro Photographer is truly great game which is available on AiFreeGame.com absolutely for free. Ellie Pro Photographer has a vast list of categories, for example one-player and girls and many more such as fashion, other games as well. This is an HTML5 game and your current device supports it. To controll use your finger on mobile and mouse and keyboard on PC to beat the score. Feel yourself at home playing Ellie Pro Photographer online game for free on this site.","gametype":"","url":"http://html5.gamedistribution.com/82fa03c77d9f45478312ce020c8b9f64/","tags":"","cat":37,"title":"Ellie Pro Photographer","img":"/cover/8113.png","played":"","date":""},{"desc":"  games intro:    The two sisters were ready to decorate their rooms for the new year. Now let's arrange their rooms together and take stock of this year's achievements and finally dress up for the new year.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20170105/j3/index.html","tags":"","cat":37,"title":"New Year's Weather For Princesses","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14068.jpg","played":"","date":""},{"desc":"Tris is back and ready to try out the coolest winter clothes ever! Curious to see what's in the mystery boxes? Open them up, go through cozy tops, bottoms and find the pe...","gametype":"","url":"http://html5.gamedistribution.com/8805c3c40cda40148d5416fe33a2095b/","tags":"","cat":37,"title":"Tris Winter Fashion Dolly Dress Up","img":"/cover/8843.png","played":"","date":""},{"desc":"Calling all the Disney fans! Princess Cinderella, Elena of Avalor and your favourite Ice Queen - Frozen Elsa are now getting ready to enter the Fidget Spinner Competition...","gametype":"","url":"http://html5.gamedistribution.com/4e7c063985b5464c89138371546aca1d/","tags":"","cat":37,"title":"Princess Fidget Spinners","img":"/cover/8889.png","played":"","date":""},{"desc":"Welcome to our toy shop,here you will have to design beautiful dolls for three little girls.You can create and customize the dolls as you like,change their skin color,eye...","gametype":"","url":"http://html5.gamedistribution.com/21b4876473e84a0b8dea37a278ba546a/","tags":"","cat":37,"title":"Toy Shop","img":"/cover/8803.png","played":"","date":""},{"desc":"Princess Aurora are attending her homecoming party for the first time tonight! She wants to appear magnificently, but her bodyhair are too.. much at the moment. She will ...","gametype":"","url":"http://html5.gamedistribution.com/a8313dd7a75e4427b130b161d566e7f5/","tags":"","cat":37,"title":"Homecoming Princess Aurora","img":"/cover/8551.png","played":"","date":""},{"desc":"Prepare our three princesses for the movie awards event tonight!Pick the best fashion outfits for them,your their personal fashion stylist.With your help they will shine ...","gametype":"","url":"http://html5.gamedistribution.com/cef33743ea8745ecb3947a1cc8538e38/","tags":"","cat":37,"title":"Celebrity Event","img":"/cover/8656.png","played":"","date":""},{"desc":"  games intro:    The theme of this issue is snowflake, now for the princesses to change into snowflake theme costumes, a good dress up! With the princesses shake up the snowflake skirt, meet the cold winter day.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20170104/j2/index.html","tags":"","cat":37,"title":"Princess Snowflake Costume","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14067.jpg","played":"","date":""},{"desc":"Princess Famous Tumblr Girl is among the great free games in aifreegame.com. Play Princess Famous Tumblr Girl and Pick your best Friv 1000 game in the amazing long list without any charges.","gametype":"","url":"http://html5.gamedistribution.com/d988968b367f45f6a4ccc48e2c9d9833/","tags":"","cat":37,"title":"Princess Famous Tumblr Girl","img":"/cover/8620.png","played":"","date":""},{"desc":"Ariel is a new student at her school. She has no friends yet, but she is full of enthusiasm. Let’s help Little Mermaid to become more popular at school and get new frie...","gametype":"","url":"http://html5.gamedistribution.com/3472c4a881c7464e9e90cc7b3bb4cbb0/","tags":"","cat":37,"title":"School Popularity Guide for Princesses","img":"/cover/8761.png","played":"","date":""},{"desc":"Barbie is a super talented singer. She has her own band and together with her boys she sings covers at the coolest parties in town. But recently she realised that she wan...","gametype":"","url":"http://html5.gamedistribution.com/a54dbfdfd7b84d939d97eb29906ee3f6/","tags":"","cat":37,"title":"Barbie The Voice","img":"/cover/8682.png","played":"","date":""},{"desc":"Tinker will be meeting her friends. Help her choose the best fairy outfit, and the perfect wings!","gametype":"","url":"http://html5.gamedistribution.com/b851b04d8b704de38666ee78918cc37a/","tags":"","cat":37,"title":"Fairy Tinker Makeover","img":"/cover/8787.png","played":"","date":""},{"desc":"  games intro:    Christmas was coming, and the princesses could not wait to start shopping. Let's join them, put on beautiful new clothes, and join us for a wonderful Christmas.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161229/b2/index.htm","tags":"","cat":37,"title":"The Princesses' Preparations For Christmas","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14062.jpg","played":"","date":""},{"desc":"This mobile game which title is Mermaid flies to Tokyo is truly great game which is available on GekoGames absolutely for free. Mermaid flies to Tokyo has a vast list of categories, for example girls and arcade and many more such as adventure, cartoon, dress-up, mermaid, one-player games as well. This is an HTML5 game and it can be played on tablets and mobile phones. To controll use your finger on mobile and mouse and keyboard on PC in this game. Have fun playing Mermaid flies to Tokyo online game for free on this site.","gametype":"","url":"http://html5.gamedistribution.com/4548501e0062416692da9a082be103ee/","tags":"","cat":37,"title":"Mermaid flies to Tokyo","img":"/cover/8297.png","played":"","date":""},{"desc":"Living in her ice made castle begin to be pretty boring for our below Frozen Queen, Elsa, so princess Anna came up with this crazy idea and she suggested Elsa should trav...","gametype":"","url":"http://html5.gamedistribution.com/2925bddb4ad94c1492995378023d7906/","tags":"","cat":37,"title":"Ice Princess In NYC","img":"/cover/8957.png","played":"","date":""},{"desc":"Annie and Kristof decided that they want to throw a big wedding party this weekend. You can join there royal party but first help Annie prepare for it. Choose the perfect...","gametype":"","url":"http://html5.gamedistribution.com/9a1bd34a7b2c41d49a43264ddc1d48b4/","tags":"","cat":37,"title":"Princess Annie Summer Wedding","img":"/cover/8706.png","played":"","date":""},{"desc":"Disney princess Elsa, Ariel and Rapunzel are working in the circus. Each and every day they are rocking in their shows with their awesome performance and wonderful outfit...","gametype":"","url":"http://html5.gamedistribution.com/ad7cb06813724cdc868ce2bd0f214051/","tags":"","cat":37,"title":"Princess In Circus Show","img":"/cover/8665.png","played":"","date":""},{"desc":"Our beautiful princesses have been invited to the special VIP party, that is about to take place once a year. This time, the main theme is going to be the white color. Ev...","gametype":"","url":"http://html5.gamedistribution.com/c1342d0fdb88437e9518142290c66338/","tags":"","cat":37,"title":"Princess All White Night Party","img":"/cover/8704.png","played":"","date":""},{"desc":"It's makeup time! The princess needs your help today. She has an entire room full of makeup products. Let's see if you can find the best makeup combination. Use the produ...","gametype":"","url":"http://html5.gamedistribution.com/51774434b4124a71b795a5b7ae80f202/","tags":"","cat":37,"title":"Ice Princess Makeup Time","img":"/cover/8885.png","played":"","date":""},{"desc":"Our princess and her Prince are going to a special Red Carpet event where they will meet other princesses and royal characters.Help our beautiful princess with the make u...","gametype":"","url":"http://html5.gamedistribution.com/e7c1a19bc6d047f8bb79136633fa558f/","tags":"","cat":37,"title":"Red Carpet Stars","img":"/cover/8908.png","played":"","date":""},{"desc":"  games intro:    The three princesses came to Christmas Island with gifts everywhere. Help the princesses find all the gifts! Then you can go into Christmas Island and start dressing up for a nice Christmas.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161231/b1/index.html","tags":"","cat":37,"title":"Princess's Christmas Island Trip","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14064.jpg","played":"","date":""},{"desc":"Moana is new at Princess College. Join Moana while she arrives at the college dorm. She needs help to unpack and get ready for the first college day. She'll meet new frie...","gametype":"","url":"http://html5.gamedistribution.com/d8bec82dc0d6485aa73c62fcf4d3b64f/","tags":"","cat":37,"title":"New Girl at Princess College","img":"/cover/8833.png","played":"","date":""},{"desc":"Princesses Cinderella and Aurora are well-known high fashion divas. This time they are VIP guests at the world-famous Paris Fashion Week, and they need your special advic...","gametype":"","url":"http://html5.gamedistribution.com/f098138eb0cd4086aea234e786c6ce06/","tags":"","cat":37,"title":"VIP Princesses Paris Fashion Week","img":"/cover/8637.png","played":"","date":""},{"desc":"This is our latest game called Ellie Mermaid vs Princess.You will find our girl in two hypostasis, of the mermaid and the princess. You will help both of them dress up fo...","gametype":"","url":"http://html5.gamedistribution.com/3d6e86e3be4f4aaeb6dc0545ecd7a1bc/","tags":"","cat":37,"title":"Ellie Mermaid Vs Princess","img":"/cover/8641.png","played":"","date":""},{"desc":"Six of our top models are preparing for a photo shooting session to appear on different fashion covers.Do your best to make them look great!","gametype":"","url":"http://html5.gamedistribution.com/b8c263b46b574850b7deee90d5760f79/","tags":"","cat":37,"title":"Fashion Cover Diva","img":"/cover/9022.png","played":"","date":""},{"desc":"New fashion challenge is about to begin, join your favorite princesses at their new trendy photoshoot! The princesses have been asked for a trendy photoshoot to promote a...","gametype":"","url":"http://html5.gamedistribution.com/d6e465eeaec94ebebbd94e3a8c1ab559/","tags":"","cat":37,"title":"Princesses Trendy Photoshoot","img":"/cover/8789.png","played":"","date":""},{"desc":"Denim is back in trend! Fashion designer Cinderella always keeps up with the hottest trends, so she created a denim collection for summer 2017. Together with her friends,...","gametype":"","url":"http://html5.gamedistribution.com/aaf71b68dd8148b5803df9af8a0ba3fd/","tags":"","cat":37,"title":"Princess Denim Collection","img":"/cover/8554.png","played":"","date":""},{"desc":"Wedding bells are ringing for the mermaid princess. She and her bridesmaids are happier than ever! The three princesses could really use your fashion advice. Make sure th...","gametype":"","url":"http://html5.gamedistribution.com/87bfc769e62144c88643c493ffe23119/","tags":"","cat":37,"title":"Mermaid Princess Wedding Day","img":"/cover/8515.png","played":"","date":""},{"desc":"This online game which title is Instagirls Dress Up is surely fun game which is available on our site absolutely for free. Instagirls Dress Up has a vast list of categories, for example dress-up and fashion and many more such as shopping, girls games as well. This is an HTML5 game so it is fully supported by your device. The controlls are easy, just use your finger on mobile and mouse and keyboard on PC to beat the score. Have fun playing Instagirls Dress Up online game for free now.","gametype":"","url":"http://html5.gamedistribution.com/f56b7e25efcb426fbe8b9c9eaed56400/","tags":"","cat":37,"title":"Instagirls Dress Up","img":"/cover/8272.png","played":"","date":""},{"desc":"Our Modern Princesses decided that is the best time for a winter holiday skiing. These two beautiful princesses are already on the mountaintop waiting for you to pick up ...","gametype":"","url":"http://html5.gamedistribution.com/95010bae5fb24e28800534cf9176ea44/","tags":"","cat":37,"title":"Girls Winter Fun","img":"/cover/8805.png","played":"","date":""},{"desc":"After a great workout,Elsa,Rapunzel and Anna will start preparing something to eat.They need to eat healty food and will cook a salad and eat some fruits!You can join the...","gametype":"","url":"http://html5.gamedistribution.com/d06dd332a53540eea506fd42d1ea63dd/","tags":"","cat":37,"title":"Cooking After Workout","img":"/cover/8736.png","played":"","date":""},{"desc":"Join our two princesses in their scooter ride adventure.Try to help them dress up properly for a fun scooter ride.Their safety is on first place,so you must equipe team r...","gametype":"","url":"http://html5.gamedistribution.com/eba6682e22de4ac1adac69366eb9321e/","tags":"","cat":37,"title":"Princess Scooter Ride","img":"/cover/8738.png","played":"","date":""},{"desc":"  games intro:    It was the annual Black Friday, and the princesses were ready to go shopping. In the game, the player's task is to snap up goods in the mall, all kinds of costumes, and then dress up for yourself!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161128/j6/index.htm","tags":"","cat":37,"title":"Princess Black Friday Shopping","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14039.jpg","played":"","date":""},{"desc":"Do you know that Selena and Cinderella are the best friends? Yes, they are! Selena and Cinderella decided to organize party in the club, so they need appropriate outfits ...","gametype":"","url":"http://html5.gamedistribution.com/4f629f276a9b41d3ab3587fd7a38174e/","tags":"","cat":37,"title":"Stars & Royals BFF Party Night","img":"/cover/8839.png","played":"","date":""},{"desc":"Grand opening today! Ariel made it! She’s a business woman now, and every lovely princess can find beautiful gowns and wonderful make up service at the new Royal Boutiq...","gametype":"","url":"http://html5.gamedistribution.com/39359f94a6bc4bfc9af8f876e0efc29d/","tags":"","cat":37,"title":"Princesses Royal Boutique","img":"/cover/8552.png","played":"","date":""},{"desc":"This mobile game which name is Ladybug and Elsa Xmas Selfie is a very excellent game which is available now absolutely for free. Ladybug and Elsa Xmas Selfie is both the winter and dress-up and also one-player game. This is an HTML5 game so you can play it on any device. To operate, just use your finger on mobile and mouse and keyboard on PC and win medals in this game. Take pleasure playing Ladybug and Elsa Xmas Selfie online game for free on this site.","gametype":"","url":"http://html5.gamedistribution.com/fb045d690dea45b79b17552bad873b6c/","tags":"","cat":37,"title":"Ladybug and Elsa Xmas Selfie","img":"/cover/8347.png","played":"","date":""},{"desc":"  games intro:    The princesses have made an appointment to go to disco to relax. Now let's dress them up and let them shine in the disco. Let's get started!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161231/t1/index.html","tags":"","cat":37,"title":"The Disco Costumes Of The Princesses","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14065.jpg","played":"","date":""},{"desc":"Join Jasmine at this new amazing fashion adventure! Go shopping with Arabian beauty and find all that is necessary for any autumn! Rush to the mall and catch all the late...","gametype":"","url":"http://html5.gamedistribution.com/14350c1736e44fb7afd7370f71c3f021/","tags":"","cat":37,"title":"Princess Big Sale Rush","img":"/cover/8869.png","played":"","date":""},{"desc":"Let’s take a look at the fashion collection of one of the most popular princesses! She has got many super stylish outfits for her three different hobbies: a street raci...","gametype":"","url":"http://html5.gamedistribution.com/1eff73ae341c4c679a22e78292b3313f/","tags":"","cat":37,"title":"Trendy Outfits for Princess","img":"/cover/8625.png","played":"","date":""},{"desc":"Anna and Elsa want to have a cozy sister evening together. What about watching some movies tonight? Great! Some tasty sneaks will be perfect in front of a huge TV, so hel...","gametype":"","url":"http://html5.gamedistribution.com/21cf452c323f44e6b0a89fd9ae2ac1c3/","tags":"","cat":37,"title":"Princesses Movie Evening","img":"/cover/8995.png","played":"","date":""},{"desc":"The sisters, Elsa and Anna with their cousin, Rapunzel are having a fun night. They have prepare some nice games for them to play all through the night. Let's play with t...","gametype":"","url":"http://html5.gamedistribution.com/edf93a47be86472fb829647b25a00063/","tags":"","cat":37,"title":"Fun Sisters Night","img":"/cover/8613.png","played":"","date":""},{"desc":"It’s summer and these four beauties are getting ready for a girls beach getaway. They are going to have so much fun and you are invited to join them as well! Feel free ...","gametype":"","url":"http://html5.gamedistribution.com/f5ddc9b9c64f4d4bad3ead17a2412848/","tags":"","cat":37,"title":"Princess Summer Tans","img":"/cover/8684.png","played":"","date":""},{"desc":"This is our latest game called Annie Mermaid vs Princess.You will find our girl in two hypostasis, of the mermaid and the princess. You will help both of them dress up fo...","gametype":"","url":"http://html5.gamedistribution.com/0bc23206d77d46dbbcc09bddb582a58b/","tags":"","cat":37,"title":"Anna Mermaid Vs Princess","img":"/cover/8874.png","played":"","date":""},{"desc":"Princess Jasmine is back to break more fashion rules and to break the boundaries of normal! Fashion experts claim that you can’t wear classy clothes with sporty ones. T...","gametype":"","url":"http://html5.gamedistribution.com/0035f41f15f44b9c9839a42488755b30/","tags":"","cat":37,"title":"Princess Anti Fashion: Sporty & Classy","img":"/cover/8773.png","played":"","date":""},{"desc":"  games intro:    Christmas is coming, the princesses are meeting to go shopping, ready to dress up before going out, now let's dress up for the three beautiful princesses, and then the selfie time! Come on, eggplant.    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161223/2/index.html","tags":"","cat":37,"title":"Princess Christmas Selfie Time","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14059.jpg","played":"","date":""},{"desc":"Boho is back in trend this summer! Each fashion store offers a collection of colorful swimsuits, sheer beach dresses and statement jewelry in bohemian style. Help princes...","gametype":"","url":"http://html5.gamedistribution.com/7d6a0ba2f94d438bbc57be4b5b7bd68c/","tags":"","cat":37,"title":"Princesses Boho Beachwear Obsession","img":"/cover/8611.png","played":"","date":""},{"desc":"Summer is almost over now so Tiana, Jasmine, Elsa and Cinderella were looking for something fun to do during its last hot days. They had lots of great ideas but this time...","gametype":"","url":"http://html5.gamedistribution.com/09339b13267e4375a88fa205f1389558/","tags":"","cat":37,"title":"Princess Diner de Blanc","img":"/cover/8791.png","played":"","date":""},{"desc":"  games intro:    When winter comes, Princess Elsa wants to find her sister to play, and now start dressing herself up, putting on the most beautiful winter costume, and then decorating the elk car beautifully, and starting her family visit trip!    games playing:    mouse action     games target:    Dress up for the characters, and if you look good, don't forget to share the picture with you in the comments at the bottom of the page.    games process:    When the game is loaded, click the PLAY button-then click the play button to start the game  ","gametype":"","url":"http://sda.4399.com/4399swf/upload_swf/ftp20/ssj/20161231/b2/index.html","tags":"","cat":37,"title":"Princess Elsa In Winter Costume","img":"http://h5-cdn.aifreegame.com/gameimg/cover_200x200/14066.jpg","played":"","date":""},{"desc":"Moana has always wanted to try herself as a model. She believed one day the model agency would launch its casting for young princesses. It is time at last! Moana is super...","gametype":"","url":"http://html5.gamedistribution.com/d4247b7ef33346c385cd8afed316418d/","tags":"","cat":37,"title":"Swarthy Princess Fashion Experience","img":"/cover/8764.png","played":"","date":""},{"desc":"Get ready to go shopping with Sery, but first help her find the most amazing outfit for the day! Try out cool tops, fancy bottoms and pair them up with shoes and accessor...","gametype":"","url":"http://html5.gamedistribution.com/a045f6e0a7a042f5bc5590894f537016/","tags":"","cat":37,"title":"Sery Shopping Day Dress Up","img":"/cover/8659.png","played":"","date":""},{"desc":"This web game entitled Princess on Vacation is truly great game which is available now absolutely for free. Princess on Vacation has a vast list of categories, for example one-player and princess and many more such as girls, food, make-up, dress-up games as well. This is an HTML5 game so it runs on any device you like. To operate, just use your finger on mobile and mouse and keyboard on PC to be the best at this game. Take pleasure playing Princess on Vacation online game for free on Geko.","gametype":"","url":"http://html5.gamedistribution.com/da3351b53bcd43c9b96a8f600151fbda/","tags":"","cat":37,"title":"Princess on Vacation","img":"/cover/8159.png","played":"","date":""},{"desc":"Princess Aurora and prince Phillip are getting married today! They both study at Royal College, so they decided to celebrate their big day at college campus. Help Aurora?...","gametype":"","url":"http://html5.gamedistribution.com/0de54f2a46ea46fdb16a02ec7fe660aa/","tags":"","cat":37,"title":"Princess College Campus Wedding","img":"/cover/8497.png","played":"","date":""},{"desc":"Your favorite princesses decided they want a change of style! Join them in this new fashion adventure and try out different tops and bottoms for each of them. Find the pe...","gametype":"","url":"http://html5.gamedistribution.com/accbeeee2d4748d79c1e758dd18a540b/","tags":"","cat":37,"title":"Princesses Hipster Selfie","img":"/cover/8707.png","played":"","date":""},{"desc":"Doll Creator Fashion Looks is a great fun game where you will have to create dolls and dress them up for different events.After you create the dolls you will have to pick...","gametype":"","url":"http://html5.gamedistribution.com/ccd26e2e9192494195ee57fced7bef94/","tags":"","cat":37,"title":"Doll Creator Fashion Looks","img":"/cover/8566.png","played":"","date":""},{"desc":"Princess Aurora is a very creative person with lots of hobbies. For a girl like her, deciding on a future profession is a tough choice. So on these winter holidays Aurora...","gametype":"","url":"http://html5.gamedistribution.com/0e6cadc04bd84c058b782cd1e109e652/","tags":"","cat":37,"title":"Princess Odd Jobs Choice","img":"/cover/8560.png","played":"","date":""},{"desc":"The fun days at the Burning Man festival is about to begin really soon and these 4 BFFs have no clue what jaw-dropping fashion looks to flaunt for this occasion! And that...","gametype":"","url":"http://html5.gamedistribution.com/a11f1b657a634c82ba4ba6bb0005f855/","tags":"","cat":37,"title":"Princess BFF Burning Man","img":"/cover/8777.png","played":"","date":""},{"desc":"The princesses have started a new ambitious project! They are opening the new Art Gallery! This is supposed to be the greatest event within fashionable society, so you sh...","gametype":"","url":"http://html5.gamedistribution.com/20939d31341e42a6810b3a1ace46b25f/","tags":"","cat":37,"title":"Princesses Open Art Gallery","img":"/cover/8953.png","played":"","date":""},{"desc":"Spring is finally here and these two sisters can't wait to wear cute dresses once again! Join them in one of the most adorable girl games ever! The two pretty girls need ...","gametype":"","url":"http://html5.gamedistribution.com/20734b5c51a14227b946edb48b8b5eac/","tags":"","cat":37,"title":"Sisters Spring Day","img":"/cover/8666.png","played":"","date":""},{"desc":"The lovely Frozen princess, Elsa, has a fashion blog. She likes to share new ideas, and today is no different. She wants to make a blog all about the metallic skirts. Hel...","gametype":"","url":"http://html5.gamedistribution.com/a5e50095503c46d8af1b1c92956d5160/","tags":"","cat":37,"title":"Princess Metallic Skirts","img":"/cover/8646.png","played":"","date":""},{"desc":"For a young lady, there’s no cooler thing in the whole world than a party. And what could be better than a good party with your besties? Of course, two parties in a row...","gametype":"","url":"http://html5.gamedistribution.com/f56de5ef149cf0aedcc8f4797031e229/","tags":"","cat":37,"title":"Princess Parties: From Streets to Suites","img":"/cover/8690.png","played":"","date":""},{"desc":"Elsa and Anna Frozen would like to start a new life this year. They want to update their rooms' design and choose absolutely new style for themselves. It will be fun to s...","gametype":"","url":"http://html5.gamedistribution.com/dd3d33d6708d49fc8d3ee8dd9f4b5e13/","tags":"","cat":37,"title":"Princesses New Lifestyle","img":"/cover/8710.png","played":"","date":""},{"desc":"It’s back to school time and these Disney Girls are pretty excited about it. They are in the senior year this year and that means this is their last chance to decorate ...","gametype":"","url":"http://html5.gamedistribution.com/c001a3207ce64f51ad3e66ed7660d460/","tags":"","cat":37,"title":"Princess Back 2 School Lockers","img":"/cover/8774.png","played":"","date":""},{"desc":"Three princesses are throwing three parties. Help them get ready and decorate their places with lamps, fairy lights, and flowers. Then, help the girls create a beautiful ...","gametype":"","url":"http://html5.gamedistribution.com/1b6ad13863c44691922496f77993b0fb/","tags":"","cat":37,"title":"Princesses Party Marathon","img":"/cover/9002.png","played":"","date":""},{"desc":"The famous flower show is about to begin, and two beautiful princesses are not gonna miss it! Help the princesses get ready for this event. Take care of their outfit by c...","gametype":"","url":"http://html5.gamedistribution.com/ff56e6b7b46c49c1acb0d4788de50cc2/","tags":"","cat":37,"title":"Princesses Flower Show","img":"/cover/8651.png","played":"","date":""},{"desc":"Kendama is a very popular game,and our princess want to practice and participate in her first kendama contest.In this kendama contest everyone must come with a personaliz...","gametype":"","url":"http://html5.gamedistribution.com/91c873c6c47240f5b7e46ecacd033402/","tags":"","cat":37,"title":"Princess Kendama Design","img":"/cover/8895.png","played":"","date":""},{"desc":"Fashion is always a battle between different styles and points of view. Two young fashionistas, princesses Belle and Merida, are keen on absolutely different clothes. And...","gametype":"","url":"http://html5.gamedistribution.com/18b0851f3adc4a3f94382f4569d92198/","tags":"","cat":37,"title":"Princesses Fashion Wars: Boho VS Gowns","img":"/cover/8700.png","played":"","date":""},{"desc":"Princess Rapunzel and Moana are going to complete their college studies. They have to choose their profession and build their career. But they have some confusion of choo...","gametype":"","url":"http://html5.gamedistribution.com/e38791f0d4e64ff0a707418972baf721/","tags":"","cat":37,"title":"BFF Princess Career Photoshoot","img":"/cover/8696.png","played":"","date":""},{"desc":"Princess Moana, Ariel and Elena visits india for the spending their holiday. They are going to attend the gala with bollywood stars tonight. So they have to pick the Indi...","gametype":"","url":"http://html5.gamedistribution.com/3cf7861bba5e445b8a74c9969bc067f4/","tags":"","cat":37,"title":"Princess Indian Gala Fashion","img":"/cover/8499.png","played":"","date":""},{"desc":"Ariel and Elsa want to share their best ideas of awesome teenage fashion look with everybody! That’s why the princesses have decided to show their collection of dazzlin...","gametype":"","url":"http://html5.gamedistribution.com/f47b3241841048a9af85808a7c89391a/","tags":"","cat":37,"title":"10 Perfect Outfits for Princesses","img":"/cover/8677.png","played":"","date":""},{"desc":"Get ready to discover the best of the best fall flannels in this brand-new dress up game for girls. The Frozen Sisters, Aurora and Moana have their wardrobes ruled by the...","gametype":"","url":"http://html5.gamedistribution.com/5081f5fbdf734d96b1187e7404b501ac/","tags":"","cat":37,"title":"Princess Fall Flannels","img":"/cover/8719.png","played":"","date":""},{"desc":"This new game called Princess Safari Style is quite fun game which is available here absolutely for free. Princess Safari Style has a vast list of categories, for example one-player and princess and many more such as girls, dress-up games as well. This is an HTML5 game and it is fully compatible with your device. To operate, just use your finger on mobile and mouse and keyboard on PC in this game. Be our guest playing Princess Safari Style online game for free on this site.","gametype":"","url":"http://html5.gamedistribution.com/57577f10ae3b4c278c8922f10fc1bee4/","tags":"","cat":37,"title":"Princess Safari Style","img":"/cover/8481.png","played":"","date":""},{"desc":"Great news, ladies! Your favorite Disney princesses are heading to the Coachella Valley Music and Arts Festival and they have an extra ticket for you! Elsa, Cinderella, A...","gametype":"","url":"http://html5.gamedistribution.com/d2114a9b0bb54a5383da351433e8ab3c/","tags":"","cat":37,"title":"Princess Coachella","img":"/cover/8785.png","played":"","date":""},{"desc":"It’s the first day of college for Elsa, Anna, Ariel and Jasmine and our girls have big plans for it: they are committed to join a sorority but they are going to need yo...","gametype":"","url":"http://html5.gamedistribution.com/e35c8f221ff74259a504af0b3f7b2a60/","tags":"","cat":37,"title":"Princess Sorority Pledges","img":"/cover/8679.png","played":"","date":""},{"desc":"Princess Jasmine is throwing a big yard sale, and her BFFs – Ariel and Elsa - are the first to come and see, what cute casual clothes, shoes and accessories their frien...","gametype":"","url":"http://html5.gamedistribution.com/48a8bc5f9740452fb2ad08673b9c17f0/","tags":"","cat":37,"title":"Princesses at Yard Sale","img":"/cover/8944.png","played":"","date":""},{"desc":"Our Modern Princesses decided that Is the best time for a winter holiday in Arendelle skiing. This three beautiful princesses are already on the mountaintop waiting for y...","gametype":"","url":"http://html5.gamedistribution.com/8060bb571257412e9425822fab33787f/","tags":"","cat":37,"title":"Princesses Winter Holiday","img":"/cover/8661.png","played":"","date":""},{"desc":"Our princesses are in holidays at ski for some little fun. When they arrived at the hottel, they had some huge problems, of course the clothes. You are the expert and you...","gametype":"","url":"http://html5.gamedistribution.com/c916dba84fde436a993ffc831192e101/","tags":"","cat":37,"title":"Princesses At Ski","img":"/cover/8757.png","played":"","date":""},{"desc":"Easter is here and our beautiful girls are ready for this big event. They opened an egg magazine in the central park but they have still so much to do before they will fi...","gametype":"","url":"http://html5.gamedistribution.com/3aed11564a5545b0972c7b166813888e/","tags":"","cat":37,"title":"Girls Easter Chocolate Eggs","img":"/cover/8890.png","played":"","date":""},{"desc":"Spring is the best time for changes! Princesses Jasmine and Aurora decided to update their wardrobes. Join them as they shop for spring 2017’s hottest trends. As her pe...","gametype":"","url":"http://html5.gamedistribution.com/1cb7b62dce354b36bf127e7b64511da1/","tags":"","cat":37,"title":"Princesses Spring Trend Alerts","img":"/cover/8715.png","played":"","date":""},{"desc":"The spring is here, and our princesses are in great mood! They feel a little playful and mischievous, so Rapunzel got a great idea. Why don’t they prank their friends i...","gametype":"","url":"http://html5.gamedistribution.com/de4c94dcc19e475f9604d93a41e9fe81/","tags":"","cat":37,"title":"Princesses Funny Prank","img":"/cover/8991.png","played":"","date":""},{"desc":"Princess Ariel is going to visit Art College classes. Help her get ready and pack her school bag for classes. Then, choose the most fashionable outfit for her, and go to ...","gametype":"","url":"http://html5.gamedistribution.com/9dabaed7c26149ffbc7add2872b2d7fe/","tags":"","cat":37,"title":"Art College Classes for Princess","img":"/cover/8492.png","played":"","date":""},{"desc":"The ever beauties princess belle and Jasmine are traveling around Africa and they are impressed by African culture, so they would like to wear amazing African style cloth...","gametype":"","url":"http://html5.gamedistribution.com/f6b3fd68b86a4205885af3bcde63cb8b/","tags":"","cat":37,"title":"Princess in Africa","img":"/cover/8891.png","played":"","date":""},{"desc":"Get ready to meet two of the youngest rich Asian princesses ever known: Jasmine and Mulan. With their beauty, smart-thinking and the power of social media they managed bu...","gametype":"","url":"http://html5.gamedistribution.com/fd9631b5858a49708a2186e4918209ce/","tags":"","cat":37,"title":"Crazy Rich Asian Princesses","img":"/cover/8923.png","played":"","date":""},{"desc":"The floss dance has taken over the world and the princesses are trying to learn it! Moana already knows its moves and she created a step-by-step guide for her BFFs to lea...","gametype":"","url":"http://html5.gamedistribution.com/6facb0bd53e54f328d4fe137b61a2b0a/","tags":"","cat":37,"title":"Princess BFF Floss Dance","img":"/cover/8778.png","played":"","date":""},{"desc":"Are you ready for another cute themed dress up game? Today you are invited to help Jasmine, Tiana and Elsa discover the colorful harajuku fashion style and trust me… yo...","gametype":"","url":"http://html5.gamedistribution.com/b289ab52556f4dc0b2014e9561ebc3bb/","tags":"","cat":37,"title":"Harajuku Princess","img":"/cover/8935.png","played":"","date":""},{"desc":"From Blink-182, the Beatles, Nirvana, Metallica and more these Disney babes have a band t-shirt to match their musical tastes and maybe yours, too. Come and join them in ...","gametype":"","url":"http://html5.gamedistribution.com/780a075ab8b744168a3af603ae46a928/","tags":"","cat":37,"title":"Princess Band Tees","img":"/cover/8776.png","played":"","date":""},{"desc":"The time for the most colourful parade is here and you ladies are invited to join Queen Elsa and princesses Anna, Tiana and Jasmine for a fun session of celebration. Get ...","gametype":"","url":"http://html5.gamedistribution.com/5430f5cd4d4f4448a3e1be3117f73aa8/","tags":"","cat":37,"title":"Princess LGBT Parade","img":"/cover/8897.png","played":"","date":""},{"desc":"Jasmine and Rapunzel are camping near a mountain lake. The place is so beautiful, they are having a good time there. Making BBQ and dress up a bit, what a good life!","gametype":"","url":"http://html5.gamedistribution.com/6eb00ffe5e1742e9885bc684ac5b712f/","tags":"","cat":37,"title":"Princess on Camping","img":"/cover/8734.png","played":"","date":""}],"site":"www.aifreegame.com","index":{"fashion-cover-diva":134,"princess-haul-young-fashion":88,"princess-sorority-pledges":182,"princess-odd-jobs-choice":164,"celebrity-event":116,"the-princesss-christmas":48,"princess-anti-fashion-sporty-classy":153,"princess-denim-collection":136,"princesss-christmas-island-trip":130,"ellie-fairytale-princess":44,"the-disco-costumes-of-the-princesses":146,"ellie-pro-photographer":110,"princesses-flower-show":173,"princess-big-sale-rush":147,"princess-pool-party-floats":43,"princess-prom-photoshoot":102,"ice-queen-romantic-date":18,"princess-lgbt-parade":195,"princess-winter-celebration":55,"princess-snowflake-costume":117,"ice-queen-realife-shopping":52,"ice-queen-new-year-makeover":19,"the-princesss-winter-story":83,"princesses-double-boho-wedding":105,"princess-parties-from-streets-to-suites":169,"girls-winter-fun":139,"mermaid-princess-makeup-show":11,"super-girls-sauna-realife":53,"princess-band-tees":194,"snow-princess-new-year-dress":30,"princesses-trendy-photoshoot":135,"couples-love-album":29,"princess-on-camping":196,"princess-carriage-car-wash":36,"the-princesses-preparations-for-christmas":122,"elsas-day":1,"ellie-mermaid-vs-princess":133,"the-princess-dressed-up-on-the-red-carpet":50,"elsa-elf-princess-party":81,"homecoming-princess-aurora":115,"princess-annie-summer-wedding":125,"latin-princess-face-care":61,"mermaid-princess-coronation":20,"snow-white-pregnancy":9,"princess-wedding-classic-or-unusual":74,"bff-princess-career-photoshoot":176,"stars-royals-bff-party-night":143,"school-popularity-guide-for-princesses":119,"princesses-new-lifestyle-in-2017":170,"blonde-princess-massage-makeup":25,"mermaid-princess-pool-time":103,"a-colorful-album-of-princesses":2,"princesses-winter-holiday":184,"fun-sisters-night":150,"vip-princesses-paris-fashion-week":132,"princesses-cooking-contest":76,"princesses-royal-boutique":144,"princess-sneakers-design":99,"princess-coachella-inspired-wedding":95,"shimmer-and-shine-wardrobe-cleaning":22,"princess-mermaid-parade":64,"princess-christmas-selfie-time":154,"ice-princess-pool-time":56,"princess-working-in-the-park":34,"the-princesses-prom-costume":16,"new-years-weather-for-princesses":111,"princess-in-africa":190,"the-princesses-catwalk-shows":47,"princess-bff-floss-dance":192,"princess-sorority":27,"fabulous-fashionista-dress-up":82,"red-carpet-stars":129,"day-routine-with-princess":71,"princess-cotys-wedding":13,"princess-bridal-hairstyle":97,"princess-on-vacation":160,"cinderella-princess-transform":69,"barbie-party-diva":28,"princess-makes-delicious-cake":17,"princesses-hipster-selfie":162,"princess-fashion-puffer-jacket":68,"dress-up-competition":49,"sleeping-beautys-wardrobe":86,"elsa-beach-outing-preparation":7,"princesses-at-yard-sale":183,"detective-princess-to-investigate":35,"water-park-fun":77,"elsa-gift-shopping":21,"princess-coronation-day":62,"mermaid-melody":75,"princesses-funny-prank":188,"princesses-vs-celebs-fashion-challenge":91,"princesses-open-art-gallery":166,"the-princesss-secret-christmas-present":101,"sleeping-beauty-princess-role-play":42,"mermaids-bffs-realife-sauna":106,"princess-doll-house-decoration":54,"princess-rachel-shopping":45,"prom-ball-at-princess-school":85,"princesses-at-ski":185,"princess-back-2-school-lockers":171,"dress-your-barbie-for-a-wedding":31,"princesses-spring-trend-alerts":187,"ellie-vogue-blog":26,"fairy-tinker-makeover":121,"10-perfect-outfits-for-princesses":178,"swarthy-princess-fashion-experience":158,"anna-mermaid-vs-princess":152,"princess-match-accessory":92,"princess-fashion-magazine":93,"princess-celebrates-her-birthday":3,"frozen-stages-of-love":41,"princess-scooter-ride":141,"princess-diner-de-blanc":156,"princess-detective":46,"ice-kingdom-wardrobe-cleaning":39,"pregnant-princess-fashion-costume":37,"crazy-rich-asian-princesses":191,"princesss-makeup-party":94,"princess-new-spring-trends":66,"instagirls-dress-up":138,"princess-elsa-in-winter-costume":157,"princess-summer-tans":151,"princess-fidget-spinners":113,"ladybug-sauna-realife":89,"black-princess-haircut":0,"princess-college-campus-wedding":161,"the-princesss-secret-date":23,"ice-princess-wedding-day":51,"princesss-campus-love":33,"fashion-selfie-addiction":59,"princesses-masterchef-contestants":58,"mermaid-flies-to-tokyo":123,"princess-bride-magazine":109,"dolly-role-play-dress-up":73,"tris-winter-fashion-dolly-dress-up":112,"princess-casino-night":57,"princesses-fashion-wars-boho-vs-gowns":175,"princesss-winter-campus-dress":8,"princesss-zombie-costume":98,"princess-bff-burning-man":165,"elsa-secret-transform":40,"ariel-princess-vs-mermaid":108,"goldie-princesses-pregnant-check-up":6,"queen-of-glitter-prom-ball":14,"princesses-fashionable-leisure-jackets":67,"ladybug-and-elsa-xmas-selfie":145,"dotted-girl-cinema-flirting":5,"girls-photo-shopping-dress-up":104,"princess-black-friday-shopping":142,"princess-summer-make-up":96,"princesss-modern-college-time":63,"art-college-classes-for-princess":189,"princesses-party-marathon":172,"the-princesses-birthday-party":4,"princesses-great-reunion":79,"princess-all-white-night-party":127,"princess-kendama-design":174,"toy-shop":114,"princess-indian-gala-fashion":177,"trendy-outfits-for-princess":148,"princess-safari-style":180,"winter-ice-skating":78,"princesses-boho-beachwear-obsession":155,"ice-princess-makeup-time":128,"princesses-movie-evening":149,"harajuku-princess":193,"girls-easter-chocolate-eggs":186,"couples-new-year-party":24,"princess-charity-day":90,"new-girl-at-princess-college":131,"princess-in-circus-show":126,"princesses-summer-vacation-trend":87,"sery-shopping-day-dress-up":159,"frozen-wedding-ceremony":38,"princess-metallic-skirts":168,"mermaid-princess-wedding-day":137,"christmas-facial-painting":80,"tris-homecoming-dolly-dressup-h5":84,"princess-famous-tumblr-girl":118,"late-to-school-hairstyles":72,"princesses-shopping-rivals":15,"barbie-the-voice":120,"cooking-after-workout":140,"princess-coachella":181,"halloween-face-art":100,"luxury-bath-design":12,"princess-fall-flannels":179,"scary-cabin-halloween":65,"sisters-spring-day":167,"ice-princess-in-nyc":124,"pregnant-princesses-fashion-outfits":70,"ice-queen-nails-spa":32,"sally-shopping-mall-trip":107,"the-princesses-castle-dress":60,"elsa-mermaid-vs-princess":10,"doll-creator-fashion-looks":163}}